BeckZhang2006/Smart_Alarm/firmware/esp32_c5_transmitter/sdkconfig.defaults
# ESP32-C5 CSI Transmitter Configuration

# WiFi Configuration
CONFIG_ESP_WIFI_SSID="SmartAlarm_CSI_TX"
CONFIG_ESP_WIFI_PASSWORD="csicsicsi"
CONFIG_ESP_WIFI_CHANNEL=6
CONFIG_TX_PACKET_INTERVAL_MS=50
CONFIG_TX_PACKET_SIZE=256
CONFIG_ESP_WIFI_TX_POWER=20

# ESP32-C5 specific
CONFIG_IDF_TARGET="esp32c5"

# Enable WiFi
CONFIG_ESP_WIFI_ENABLED=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
